9hm2/esp32-2432s022/apps/serial-terminal/src/main.cpp
// --- Képernyo-billentyuzet -------------------------------------------------

static void close_keyboard()
{
    if (kb_overlay)
    {
        lv_obj_delete(kb_overlay);
        kb_overlay = nullptr;
        input_ta = nullptr;
    }
}

static void kb_event_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) == LV_EVENT_READY)
        send_line(lv_textarea_get_text(input_ta));
    close_keyboard();
}

static void show_keyboard()
{
    if (kb_overlay)
        return;
    const int32_t W = scrW();
    const int32_t H = scrH();
    int32_t ovH = (H * 7) / 10;
    if (ovH < 150)
        ovH = 150;
    const int32_t inH = 36;

    kb_overlay = lv_obj_create(lv_layer_top());
    lv_obj_remove_style_all(kb_overlay);
    lv_obj_set_size(kb_overlay, W, ovH);
    lv_obj_align(kb_overlay, LV_ALIGN_BOTTOM_MID, 0, 0);

    input_ta = lv_textarea_create(kb_overlay);
    lv_textarea_set_one_line(input_ta, true);
    lv_textarea_set_placeholder_text(input_ta, "command...");
    lv_obj_set_size(input_ta, W, inH);
    lv_obj_align(input_ta, LV_ALIGN_TOP_MID, 0, 0);

    lv_obj_t *kb = lv_keyboard_create(kb_overlay);
    lv_obj_set_size(kb, W, ovH - inH);
    lv_obj_align(kb, LV_ALIGN_BOTTOM_MID, 0, 0);
    lv_keyboard_set_textarea(kb, input_ta);
    lv_obj_add_event_cb(kb, kb_event_cb, LV_EVENT_READY, NULL);
    lv_obj_add_event_cb(kb, kb_event_cb, LV_EVENT_CANCEL, NULL);
}

// --- Beállítások -----------------------------------------------------------

static void close_settings()
{
    if (set_overlay)
    {
        lv_obj_delete(set_overlay);
        set_overlay = nullptr;
        dd_baud = dd_le = sw_echo = dd_rot = sw_wifi = nullptr;
    }
}

static void settings_save_cb(lv_event_t *)
{
    uint8_t oldRot = cfg.rotation;
    bool oldWifi = cfg.wifi;
    cfg.baud = BAUD_OPTIONS[lv_dropdown_get_selected(dd_baud)];
    cfg.lineEnding = (uint8_t)lv_dropdown_get_selected(dd_le);
    cfg.localEcho = lv_obj_has_state(sw_echo, LV_STATE_CHECKED);
    cfg.rotation = (uint8_t)lv_dropdown_get_selected(dd_rot);
    cfg.wifi = lv_obj_has_state(sw_wifi, LV_STATE_CHECKED);

    config_save(cfg);
    Serial.updateBaudRate(cfg.baud);
    close_settings();

    // Wi-Fi be/ki azonnal alkalmazva.
    if (cfg.wifi != oldWifi)
    {
        if (cfg.wifi)
        {
            wifi_bridge_start();
            vt.feedStr("\r\n[Wi-Fi: connecting to \"HM\"... telnet :23]\r\n");
        }
        else
        {
            wifi_bridge_stop();
            vt.feedStr("\r\n[Wi-Fi off]\r\n");
        }
    }

    if (cfg.rotation != oldRot)
        g_rebuild = true;
    else
        update_status();
}

static void settings_cancel_cb(lv_event_t *) { close_settings(); }

// A szövegbeíró billentyuzet a beállításokból hívható elo.
static void settings_keyboard_cb(lv_event_t *)
{
    close_settings();
    show_keyboard();
}

// A speciális (Fn) billentyuk a beállításokból hívhatók elo.
static void settings_keys_cb(lv_event_t *)
{
    close_settings();
    show_keys();
}

static void show_settings()
{
    if (set_overlay)
        return;

    set_overlay = lv_obj_create(lv_layer_top());
    lv_obj_set_size(set_overlay, LV_PCT(100), LV_PCT(100));
    lv_obj_set_style_bg_color(set_overlay, lv_color_black(), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(set_overlay, LV_OPA_60, LV_PART_MAIN);
    lv_obj_set_style_border_width(set_overlay, 0, LV_PART_MAIN);
    lv_obj_clear_flag(set_overlay, LV_OBJ_FLAG_SCROLLABLE);

    lv_obj_t *panel = lv_obj_create(set_overlay);
    lv_obj_set_size(panel, imin(224, scrW() - 10), imin(300, scrH() - 10));
    lv_obj_center(panel);
    lv_obj_set_style_bg_color(panel, lv_color_hex(0x1c2530), LV_PART_MAIN);
    lv_obj_set_flex_flow(panel, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_flex_align(panel, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);

    lv_obj_t *t = lv_label_create(panel);
    lv_label_set_text(t, LV_SYMBOL_SETTINGS "  Settings");
    lv_obj_set_style_text_color(t, lv_color_hex(0xFFD400), LV_PART_MAIN);
    lv_obj_set_style_text_font(t, &lv_font_montserrat_16, LV_PART_MAIN);

    lv_obj_t *lb1 = lv_label_create(panel);
    lv_label_set_text(lb1, "Baud:");
    lv_obj_set_style_text_color(lb1, lv_color_hex(0xD0D8E0), LV_PART_MAIN);
    dd_baud = lv_dropdown_create(panel);
    lv_dropdown_set_options(dd_baud, "9600\n19200\n38400\n57600\n115200\n230400");
    lv_dropdown_set_selected(dd_baud, baud_to_index(cfg.baud));
    lv_obj_set_width(dd_baud, LV_PCT(100));

    lv_obj_t *lb2 = lv_label_create(panel);
    lv_label_set_text(lb2, "Line ending (on send):");
    lv_obj_set_style_text_color(lb2, lv_color_hex(0xD0D8E0), LV_PART_MAIN);
    dd_le = lv_dropdown_create(panel);
    lv_dropdown_set_options(dd_le, "None\nLF (\\n)\nCRLF (\\r\\n)\nCR (\\r)");
    lv_dropdown_set_selected(dd_le, cfg.lineEnding <= 3 ? cfg.lineEnding : 1);
    lv_obj_set_width(dd_le, LV_PCT(100));

    lv_obj_t *row = lv_obj_create(panel);
    lv_obj_remove_style_all(row);
    lv_obj_set_size(row, LV_PCT(100), 36);
    lv_obj_set_flex_flow(row, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(row, LV_FLEX_ALIGN_SPACE_BETWEEN, LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);
    lv_obj_t *lb3 = lv_label_create(row);
    lv_label_set_text(lb3, "Local echo");
    lv_obj_set_style_text_color(lb3, lv_color_hex(0xD0D8E0), LV_PART_MAIN);
    sw_echo = lv_switch_create(row);
    if (cfg.localEcho)
        lv_obj_add_state(sw_echo, LV_STATE_CHECKED);

    lv_obj_t *lb4 = lv_label_create(panel);
    lv_label_set_text(lb4, "Orientation:");
    lv_obj_set_style_text_color(lb4, lv_color_hex(0xD0D8E0), LV_PART_MAIN);
    dd_rot = lv_dropdown_create(panel);
    lv_dropdown_set_options(dd_rot, "Portrait (46 cols)\nLandscape (62 cols)");
    lv_dropdown_set_selected(dd_rot, cfg.rotation ? 1 : 0);
    lv_obj_set_width(dd_rot, LV_PCT(100));

    // Wi-Fi telnet bevitel kapcsoló (SSID: HM)
    lv_obj_t *wrow = lv_obj_create(panel);
    lv_obj_remove_style_all(wrow);
    lv_obj_set_size(wrow, LV_PCT(100), 36);
    lv_obj_set_flex_flow(wrow, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(wrow, LV_FLEX_ALIGN_SPACE_BETWEEN, LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);
    lv_obj_t *lb5 = lv_label_create(wrow);
    lv_label_set_text(lb5, LV_SYMBOL_WIFI " Wi-Fi telnet");
    lv_obj_set_style_text_color(lb5, lv_color_hex(0xD0D8E0), LV_PART_MAIN);
    sw_wifi = lv_switch_create(wrow);
    if (cfg.wifi)
        lv_obj_add_state(sw_wifi, LV_STATE_CHECKED);

