9hm2/esp32-2432s022/apps/serial-terminal/src/main.cpp
    // Billentyuzet elohívása (alapból nem látszik)
    lv_obj_t *kbbtn = lv_button_create(panel);
    lv_obj_set_width(kbbtn, LV_PCT(100));
    lv_obj_add_event_cb(kbbtn, settings_keyboard_cb, LV_EVENT_CLICKED, NULL);
    lv_obj_t *kbl = lv_label_create(kbbtn);
    lv_label_set_text(kbl, LV_SYMBOL_KEYBOARD "  Keyboard");
    lv_obj_center(kbl);

    // Speciális (Fn) billentyuk elohívása
    lv_obj_t *fnbtn = lv_button_create(panel);
    lv_obj_set_width(fnbtn, LV_PCT(100));
    lv_obj_add_event_cb(fnbtn, settings_keys_cb, LV_EVENT_CLICKED, NULL);
    lv_obj_t *fnl = lv_label_create(fnbtn);
    lv_label_set_text(fnl, "Fn keys (arrows, Ctrl-C...)");
    lv_obj_center(fnl);

    lv_obj_t *btnrow = lv_obj_create(panel);
    lv_obj_remove_style_all(btnrow);
    lv_obj_set_size(btnrow, LV_PCT(100), 50);
    lv_obj_set_flex_flow(btnrow, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(btnrow, LV_FLEX_ALIGN_SPACE_EVENLY, LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);
    lv_obj_t *cancel = lv_button_create(btnrow);
    lv_obj_add_event_cb(cancel, settings_cancel_cb, LV_EVENT_CLICKED, NULL);
    lv_obj_t *cl = lv_label_create(cancel);
    lv_label_set_text(cl, "Cancel");
    lv_obj_t *save = lv_button_create(btnrow);
    lv_obj_add_event_cb(save, settings_save_cb, LV_EVENT_CLICKED, NULL);
    lv_obj_t *sl = lv_label_create(save);
    lv_label_set_text(sl, "Save");
}

// --- Speciális billentyuk (nyers küldés a Pi-nek) --------------------------

static lv_obj_t *keys_overlay = nullptr;

static void rawkey_cb(lv_event_t *e)
{
    send_raw((const char *)lv_event_get_user_data(e));
}

static void close_keys()
{
    if (keys_overlay)
    {
        lv_obj_delete(keys_overlay);
        keys_overlay = nullptr;
    }
}

static void keys_close_cb(lv_event_t *) { close_keys(); }

// Egy speciális gomb a panelre.
static void add_key(lv_obj_t *parent, const char *label, const char *seq)
{
    lv_obj_t *b = lv_button_create(parent);
    lv_obj_set_size(b, 50, 34);
    lv_obj_add_event_cb(b, rawkey_cb, LV_EVENT_CLICKED, (void *)seq);
    lv_obj_t *l = lv_label_create(b);
    lv_label_set_text(l, label);
    lv_obj_center(l);
}

static void show_keys()
{
    if (keys_overlay)
        return;
    const int32_t W = scrW();

    keys_overlay = lv_obj_create(lv_layer_top());
    lv_obj_set_size(keys_overlay, W, 150);
    lv_obj_align(keys_overlay, LV_ALIGN_BOTTOM_MID, 0, 0);
    lv_obj_set_style_bg_color(keys_overlay, lv_color_hex(0x1c2530), LV_PART_MAIN);
    lv_obj_set_flex_flow(keys_overlay, LV_FLEX_FLOW_ROW_WRAP);
    lv_obj_set_flex_align(keys_overlay, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER,
                          LV_FLEX_ALIGN_CENTER);
    lv_obj_set_style_pad_all(keys_overlay, 4, LV_PART_MAIN);
    lv_obj_set_style_pad_gap(keys_overlay, 4, LV_PART_MAIN);

    add_key(keys_overlay, "Esc", "\x1b");
    add_key(keys_overlay, "Tab", "\t");
    add_key(keys_overlay, LV_SYMBOL_UP, "\x1b[A");
    add_key(keys_overlay, "^C", "\x03");
    add_key(keys_overlay, LV_SYMBOL_LEFT, "\x1b[D");
    add_key(keys_overlay, LV_SYMBOL_DOWN, "\x1b[B");
    add_key(keys_overlay, LV_SYMBOL_RIGHT, "\x1b[C");
    add_key(keys_overlay, "^D", "\x04");
    add_key(keys_overlay, "^Z", "\x1a");
    add_key(keys_overlay, "Bksp", "\x7f");
    add_key(keys_overlay, LV_SYMBOL_OK, "\r"); // Enter

    lv_obj_t *cl = lv_button_create(keys_overlay);
    lv_obj_set_size(cl, 50, 34);
    lv_obj_add_event_cb(cl, keys_close_cb, LV_EVENT_CLICKED, NULL);
    lv_obj_t *cll = lv_label_create(cl);
    lv_label_set_text(cll, LV_SYMBOL_CLOSE);
    lv_obj_center(cll);
}

// --- Húzás-görgetés (scrollback) -------------------------------------------

static int s_dragY = 0, s_dragScroll = 0;

static void term_press_cb(lv_event_t *e)
{
    lv_indev_t *indev = lv_indev_active();
    if (!indev)
        return;
    lv_point_t p;
    lv_indev_get_point(indev, &p);

    if (lv_event_get_code(e) == LV_EVENT_PRESSED)
    {
        s_dragY = p.y;
        s_dragScroll = vt.scroll();
    }
    else // PRESSING
    {
        int lines = (p.y - s_dragY) / CELL_H; // lefelé húzás -> régebbi sorok
        vt.setScroll(s_dragScroll + lines);
        update_status();
        lv_obj_invalidate(term_obj);
    }
}

// --- Felso sáv gombjai -----------------------------------------------------

static void btn_cfg_cb(lv_event_t *) { show_settings(); }
static void btn_exit_cb(lv_event_t *) { return_to_launcher(); }

static void apply_rotation()
{
    lv_display_set_rotation(lv_display_get_default(),
                            cfg.rotation ? LV_DISPLAY_ROTATION_90
                                         : LV_DISPLAY_ROTATION_0);
}

// Néhány ESP32-2432S022C panelnél a kijelzot expliciten be kell kapcsolni
// (DISPON) az init után, különben csak fehér hátteret látni (nincs kép).
static void display_force_on()
{
    auto *panel = (esp_lcd_panel_handle_t)lv_display_get_user_data(
        lv_display_get_default());
    if (panel)
        esp_lcd_panel_disp_on_off(panel, true);
}

// Kis ikon-gomb a felso sáv jobb oldalára (x = jobbszéltol mért eltolás).
static void top_btn(lv_obj_t *parent, const char *sym, lv_event_cb_t cb, int x)
{
    lv_obj_t *b = lv_button_create(parent);
    lv_obj_set_size(b, 32, TOP_H - 2);
    lv_obj_align(b, LV_ALIGN_TOP_RIGHT, x, 0);
    lv_obj_set_style_pad_all(b, 0, LV_PART_MAIN);
    lv_obj_add_event_cb(b, cb, LV_EVENT_CLICKED, NULL);
    lv_obj_t *l = lv_label_create(b);
    lv_label_set_text(l, sym);
    lv_obj_center(l);
}

static void build_ui()
{
    const int32_t W = scrW();
    const int32_t H = scrH();

    lv_obj_t *scr = lv_screen_active();
    lv_obj_set_style_bg_color(scr, lv_color_hex(0x000000), LV_PART_MAIN);
    lv_obj_set_style_pad_all(scr, 0, LV_PART_MAIN);

    // Felso sáv: bal oldalt állapot, jobb oldalt beállítás + vissza gomb.
    status_lbl = lv_label_create(scr);
    lv_obj_set_style_text_color(status_lbl, lv_color_hex(0x6ff0a0), LV_PART_MAIN);
    lv_obj_set_style_text_font(status_lbl, &lv_font_montserrat_12, LV_PART_MAIN);
    lv_obj_align(status_lbl, LV_ALIGN_TOP_LEFT, 4, 4);
    top_btn(scr, LV_SYMBOL_LEFT, btn_exit_cb, -2);      // vissza (legjobbszél)
    top_btn(scr, LV_SYMBOL_SETTINGS, btn_cfg_cb, -38);  // beállítás

