9hm2/esp32-2432s022/apps/serial-terminal/src/main.cpp
    // Terminál-objektum (egyedi rajzolás). Kis margó, hogy a szélso oszlopok/
    // sorok ne lógjanak le a kijelzorol.
    const int32_t PADH = 3, PADV = 2;
    const int32_t termW = W;
    const int32_t termH = H - TOP_H;
    term_obj = lv_obj_create(scr);
    lv_obj_remove_style_all(term_obj);
    lv_obj_set_pos(term_obj, 0, TOP_H);
    lv_obj_set_size(term_obj, termW, termH);
    lv_obj_set_style_bg_color(term_obj, Vt100::defaultBg(), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(term_obj, LV_OPA_COVER, LV_PART_MAIN);
    lv_obj_set_style_pad_left(term_obj, PADH, LV_PART_MAIN);
    lv_obj_set_style_pad_right(term_obj, PADH, LV_PART_MAIN);
    lv_obj_set_style_pad_top(term_obj, PADV, LV_PART_MAIN);
    lv_obj_set_style_pad_bottom(term_obj, PADV, LV_PART_MAIN);
    lv_obj_clear_flag(term_obj, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_add_flag(term_obj, LV_OBJ_FLAG_CLICKABLE); // húzás-görgetéshez
    lv_obj_add_event_cb(term_obj, term_draw_cb, LV_EVENT_DRAW_MAIN_END, NULL);
    lv_obj_add_event_cb(term_obj, term_press_cb, LV_EVENT_PRESSED, NULL);
    lv_obj_add_event_cb(term_obj, term_press_cb, LV_EVENT_PRESSING, NULL);

    // A rács mérete a (paddinggal csökkentett) tartalom-területbol.
    vt.resize((termW - 2 * PADH) / CELL_W, (termH - 2 * PADV) / CELL_H);

    update_status();
}

static void rebuild_ui()
{
    apply_rotation();
    lv_obj_clean(lv_screen_active());
    build_ui();
}

void setup()
{
    config_load(cfg);
    Serial.begin(cfg.baud); // UART0 a Pi felé (P1: TX=GPIO1, RX=GPIO3)

    smartdisplay_init();
    display_force_on();

    apply_rotation();
    build_ui();

    vt.feedStr("VT100 terminal ready.\r\n");
    vt.feedStr("Pi -> P1 port (TX=GPIO1, RX=GPIO3, GND).\r\n\n");

    if (cfg.wifi)
    {
        wifi_bridge_start();
        vt.feedStr("[Wi-Fi: connecting to \"HM\"... telnet :23]\r\n");
    }
}

static uint32_t last_tick = 0;
static uint32_t last_draw = 0;
static constexpr uint32_t REDRAW_MS = 40; // ~25 fps — a gyors kimenetet összevonja

void loop()
{
    uint32_t now = millis();
    lv_tick_inc(now - last_tick);
    last_tick = now;

    if (g_rebuild)
    {
        g_rebuild = false;
        rebuild_ui();
    }

    // Wi-Fi telnet: kliens kezelése + a kliens gépelése -> a Pi felé.
    static bool wifiWasConnected = false;
    if (wifi_bridge_running())
    {
        wifi_bridge_poll();
        bool conn = wifi_bridge_connected();
        if (conn && !wifiWasConnected)
        {
            String line = "\r\n[Wi-Fi connected: " + wifi_bridge_ip() + "  telnet :23]\r\n";
            vt.feedStr(line.c_str());
        }
        wifiWasConnected = conn;

        uint8_t wb[64];
        int wn = wifi_bridge_read(wb, sizeof(wb));
        if (wn > 0)
        {
            Serial.write(wb, wn); // a telnet-bemenet a Pi-nek
            vt.scrollToBottom();
        }
    }

    // Felso sáv váltogatása ~3 mp-enként (port-beállítások <-> IP), ha a Wi-Fi megy.
    static uint32_t last_status = 0;
    if (now - last_status > 3000)
    {
        last_status = now;
        s_statusPage = wifi_bridge_running() ? (s_statusPage ^ 1) : 0;
        update_status();
    }

    pump_serial();

    // A terminál válasza (DSR/DA lekérdezésekre) vissza a Pi-nek.
    uint8_t rep[24];
    int rn = vt.readReply(rep, sizeof(rep));
    if (rn > 0)
        Serial.write(rep, rn);

    // Throttle: a bejövo adatot összevonjuk, és legfeljebb ~25 fps-sel rajzolunk
    // újra. Így a gyors konzol-kimenet gördülékeny marad (nem rajzol minden byte-ra).
    if (vt.dirty() && (now - last_draw) >= REDRAW_MS)
    {
        vt.clearDirty();
        last_draw = now;
        lv_obj_invalidate(term_obj);
    }

    lv_timer_handler();
    delay(2);
}
